# Задание 1: "Определение и исследование типов"
# 1.  Создайте переменные и присвойте им следующие значения:
#     a = 42
#     b = 3.14159
#     c = "Hello, Python!"
#     d = True
#     e = [1, 2, 3]
#     f = (4, 5, 6)
#     g = {"name": "Alice", "age": 30}
#     h = {7, 8, 9}
#     i = None
# 2.  Используя функцию type(), выведите на экран тип каждой переменной a до i.

# Переменные
a = 42
b = 3.14159
c = "Hello, Python!"
d = True
e = [1, 2, 3]
f = (4, 5, 6)
g = {"name": "Alice", "age": 30}
h = {7, 8, 9}
i = None

# Вывод их типов
print(f"""
{type(a)=}
{type(b)=}
{type(c)=}
{type(d)=}
{type(e)=}
{type(f)=}
{type(g)=}
{type(h)=}
{type(i)=}
""")
