import sys

try:
    # >>> sorted(["красный", "синий", "жёлтый"])
    # ['жёлтый', 'красный', 'синий']
    colors = sorted(
        input("Введите 2 цвета через пробел (красный/жёлтый/синий)> ")
        .strip()
        .lower()
        .replace("е", "ё")
        .split()
    )
except KeyboardInterrupt:
    sys.exit("\n\nПока\n")

# Да if-ы, но тоже конструкция ветвления, давно хотелось попробовать, а тут оно и выглядит хорошо
match colors:
    case ["красный", "синий"]:
        print("Если смешать, то будет - филетовый")
    case ["жёлтый", "красный"]:
        print("Если смешать, то будет - оранжевый")
    case ["жёлтый", "синий"]:
        print("Если смешать, то будет - зелёный")
    case _:
        print(
            "\n\033[31mНедопустимый ввод!\nПопробуйте ещё раз. \033[0m",
            file=sys.stderr,
        )
