# Напишите программу, определяющую евклидово расстояние между двумя точками, координаты которых заданы.
# На вход программе подаются четыре действительных числа, каждое на отдельной строке – x1,y1,x2,y2.
# Программа должна вывести одно число – евклидово расстояние.


import math
import sys

try:
    print("Первая точка:")
    x1 = float(input("Введите X1> "))
    y1 = float(input("Введите Y1> "))
    print("Вторая точка:")
    x2 = float(input("Введите X2> "))
    y2 = float(input("Введите Y2> "))
except ValueError:
    print(
        # "\033[31m" и "\033[0m" для то что бы текст был красным
        "\n\033[31mВсё координаты должны быть действительными числами!\nПопробуйте ещё раз. \033[0m",
        # Это ошибка, так что пишу в стандартный поток вывода ошибок
        file=sys.stderr,
    )
    # Завершаю программу
    sys.exit(1)

# Выхожу если нажать ctrl+c, а почему нет?)
except KeyboardInterrupt:
    sys.exit("\n\nПока\n")


# print(f"Растояние между точками: {math.sqrt((x1 - x2) ** 2 + (y1 - y2) ** 2)}")

print(math.sqrt((x1 - x2) ** 2 + (y1 - y2) ** 2))
