# Напишите программу для пересчёта величины временного интервала, заданного в минутах, в величину, выраженную в часах и минутах в следующем формате:
#
# <исходное кол-во минут> минуты - это <полное кол-во часов> час <оставшееся кол-во минут> минут.
#
# На вход программе подаётся целое число – количество минут.
#
# Программа должна вывести текст в соответствии с условием задачи.

import sys

try:
    total_minutes = int(input("Введите колличество минут> "))
except ValueError:
    print(
        # "\033[31m" и "\033[0m" для то что бы текст был красным
        "\n\033[31mЧисло должно быть целым!\nПопробуйте ещё раз. \033[0m",
        # Это ошибка, так что пишу в стандартный поток вывода ошибок
        file=sys.stderr,
    )
    # Завершаю программу
    sys.exit(1)

# Выхожу если нажать ctrl+c, а почему нет?)
except KeyboardInterrupt:
    sys.exit("\n\nПока\n")

hours = total_minutes // 60
minutes = total_minutes % 60

print(f"{total_minutes} минуты - это {hours} час {minutes} минут.")
