# В купейном вагоне имеется 9 купе с четырьмя местами для пассажиров в каждом. Напишите программу, которая определяет номер купе, в котором находится место с заданным номером (нумерация мест сквозная, начинается с 1).
#
# На вход программе подаётся целое число – место с заданным номером в вагоне.
# Программа должна вывести одно число – номер купе, в котором находится указанное место.


import math
import sys

try:
    place = int(input("Введите номер места> "))

    # Всё же попробую проверить что число <= 36 без if
    1 / ((37 - place + abs(37 - place)) // (2 * (37 - place)))
    # Ну и > 0 тоже
    1 / ((place + abs(place)) // (2 * place))

except ValueError:
    print(
        # "\033[31m" и "\033[0m" для то что бы текст был красным
        "\n\033[31mЧисло должно быть целым!\nПопробуйте ещё раз. \033[0m",
        # Это ошибка, так что пишу в стандартный поток вывода ошибок
        file=sys.stderr,
    )
    # Завершаю программу
    sys.exit(1)

except ZeroDivisionError:
    print(
        # "\033[31m" и "\033[0m" для то что бы текст был красным
        "\n\033[31mЧисло должно быть в диапозоне от 1 до 36!\nПопробуйте ещё раз. \033[0m",
        # Это ошибка, так что пишу в стандартный поток вывода ошибок
        file=sys.stderr,
    )
    # Завершаю программу
    sys.exit(1)

# Выхожу если нажать ctrl+c, а почему нет?)
except KeyboardInterrupt:
    sys.exit("\n\nПока\n")

cabin = math.ceil(place / 4)

# print(f"Ваше купе -  {cabin}")
print(cabin)
