# n школьников делят k мандаринов поровну, неделящийся остаток остается в корзине. Сколько целых мандаринов достанется каждому школьнику? Сколько целых мандаринов останется в корзине?
#
# На вход программе подаются два целых числа: количество школьников и количество мандаринов, каждое на отдельной строке.
#
# Программа должна вывести два числа: количество мандаринов, которое достанется каждому школьнику, и количество мандаринов, которое останется в корзине, каждое на отдельной строке.

import sys

try:
    people = int(input("Введите количество школьников> "))
    mandarins = int(input("Введите количество мандаринов> "))
except ValueError:
    print(
        # "\033[31m" и "\033[0m" для то что бы текст был красным
        "\n\033[31mОба числа должны быть целыми!\nПопробуйте ещё раз. \033[0m",
        # Это ошибка, так что пишу в стандартный поток вывода ошибок
        file=sys.stderr,
    )
    # Завершаю программу
    sys.exit(1)

# Выхожу если нажать ctrl+c, а почему нет?)
except KeyboardInterrupt:
    sys.exit("\n\nПока\n")

per_person = mandarins // people
remaining = mandarins - per_person * people

# print(f"Каждому достанется по - {per_person} мандаринов.\nВ корзине останется - {remaining} мандаринов.")

print(per_person)
print(remaining)
