# Напишите программу для нахождения цифр четырёхзначного числа.
# На вход программе подаётся положительное четырёхзначное целое число.
# Программа должна вывести текст в соответствии с условием задачи.


import sys

try:
    num = int(input("Введите 4-значное положительное целое число> "))
except ValueError:
    print(
        # "\033[31m" и "\033[0m" для то что бы текст был красным
        "\n\033[31mЧисло должно быть целым!\nПопробуйте ещё раз. \033[0m",
        # Это ошибка, так что пишу в стандартный поток вывода ошибок
        file=sys.stderr,
    )
    # Завершаю программу
    sys.exit(1)

# Выхожу если нажать ctrl+c, а почему нет?)
except KeyboardInterrupt:
    sys.exit("\n\nПока\n")

# Ну пусть эти проверки будут)
# Можно конечно заменить if на try-except где внутри при нарушении получается ZeroDivisionError...
# Но это ещё более странная штука чем-то чем занимаюсь я)
if num < 0:
    print(
        # "\033[31m" и "\033[0m" для то что бы текст был красным
        "\n\033[31mЧисло должно быть положительным!\nПопробуйте ещё раз. \033[0m",
        # Это ошибка, так что пишу в стандартный поток вывода ошибок
        file=sys.stderr,
    )
    # Завершаю программу
    sys.exit(1)

if not (1000 <= num <= 9999):
    print(
        # "\033[31m" и "\033[0m" для то что бы текст был красным
        "\n\033[31mЧисло должно быть 4-значным!\nПопробуйте ещё раз. \033[0m",
        # Это ошибка, так что пишу в стандартный поток вывода ошибок
        file=sys.stderr,
    )
    # Завершаю программу
    sys.exit(1)


print(f"""
Цифра в позиции тысяч равна {num // 1000}
Цифра в позиции сотен равна {(num // 100) % 10}
Цифра в позиции десятков равна {(num // 10) % 10}
Цифра в позиции единиц равна {num % 10}
""")
