# Напишите программу, которая принимает на вход действительное число x и вычисляет по нему значение: ⌊x⌋+⌈x⌉
#
# На вход программе подаётся одно действительное число x.
# Программа должна вывести одно число – значение указанного выражения.


import math
import sys

try:
    x = float(input("Введите X> "))
except ValueError:
    print(
        # "\033[31m" и "\033[0m" для то что бы текст был красным
        "\n\033[31mХ должен быть действительным числом!\nПопробуйте ещё раз. \033[0m",
        # Это ошибка, так что пишу в стандартный поток вывода ошибок
        file=sys.stderr,
    )
    # Завершаю программу
    sys.exit(1)

# Выхожу если нажать ctrl+c, а почему нет?)
except KeyboardInterrupt:
    sys.exit("\n\nПока\n")

# А ну и да, блок выше был скопирован с прошлой практики и слегка отредактирован)

# print(f"⌊x⌋+⌈x⌉ = {math.floor(x) + math.ceil(x)}")

print(math.floor(x) + math.ceil(x))
